using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Drawing.Drawing2D;
using System.Drawing.Printing;
using System.IO;
using System.Linq;
using System.Reflection.Emit;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using System.Xml.Linq;

namespace Horoscope
{
    public partial class Horoscope : Form
    {
        public Horoscope()
        {
            InitializeComponent();
        }

        private void RoundControl(Control c, int radius)
        {
            var path = new GraphicsPath();
            path.StartFigure();
            path.AddArc(new Rectangle(0, 0, radius, radius), 180, 90);
            path.AddArc(new Rectangle(c.Width - radius, 0, radius, radius), 270, 90);
            path.AddArc(new Rectangle(c.Width - radius, c.Height - radius, radius, radius), 0, 90);
            path.AddArc(new Rectangle(0, c.Height - radius, radius, radius), 90, 90);
            path.CloseFigure();

            c.Region = new Region(path);
        }

        private void Horoscope_Load(object sender, EventArgs e)
        {

            RoundControl(button1, 30);
            RoundControl(happy, 30);
            RoundControl(save, 30);
            RoundControl(back, 30);
            RoundControl(dateTimePicker2, 30);
            RoundControl(label2, 30);
            RoundControl(label1, 30);

            this.WindowState = FormWindowState.Maximized;
            this.BackgroundImage = Image.FromFile("C:\\Users\\nurga\\source\\repos\\Horoscope\\Horoscope\\images\\b.png");


            label1.Visible = true;
            label1.Left = (this.ClientSize.Width - label1.Width) / 2;
            label1.Top = 200;
            label2.Visible = true;
            label2.Left = (this.ClientSize.Width - label2.Width) / 2;
            dateTimePicker2.Visible = true;
            dateTimePicker2.Left = (this.ClientSize.Width - dateTimePicker2.Width) / 2;
            button1.Visible = true;
            button1.Left = (this.ClientSize.Width - button1.Width) / 2;
            happy.Visible = true;
            happy.Left = (this.ClientSize.Width - happy.Width) / 2;
            happy.Top = button1.Bottom + 10;

            back.Visible = false;
            save.Visible = false;
            save.Location = back.Location;
            save.Top = back.Bottom + 10;

            pictureZodiac.Visible = false;

            ResultName.Text = "";
            ResultDescription.Text = "";
            ResultDescription.AutoSize = true;
            ResultDescription.MaximumSize = new Size(this.Width-500,0);
        }

        private void label2_Click(object sender, EventArgs e)
        {
            // керек емес
        }

        private void dateTimePicker2_ValueChanged(object sender, EventArgs e)
        {
            // керек емес
        }

        private string GetZodiac(DateTime birthDate)
        {
            int day = birthDate.Day;
            int month = birthDate.Month;

            switch (month)
            {
                case 1:
                    return (day <= 19) ? "Тауешкі" : "Суқұйғыш";
                case 2:
                    return (day <= 18) ? "Суқұйғыш" : "Балықтар";
                case 3:
                    return (day <= 20) ? "Балықтар" : "Тоқты";
                case 4:
                    return (day <= 19) ? "Тоқты" : "Торпақ";
                case 5:
                    return (day <= 20) ? "Торпақ" : "Егіздер";
                case 6:
                    return (day <= 20) ? "Егіздер" : "Шаян";
                case 7:
                    return (day <= 22) ? "Шаян" : "Арыстан";
                case 8:
                    return (day <= 22) ? "Арыстан" : "Бикеш";
                case 9:
                    return (day <= 22) ? "Бикеш" : "Таразы";
                case 10:
                    return (day <= 22) ? "Таразы" : "Сарышаян";
                case 11:
                    return (day <= 21) ? "Сарышаян" : "Мерген";
                case 12:
                    return (day <= 21) ? "Мерген" : "Тауешкі";
                default:
                    return "";
            }
        }

        private Dictionary<string, string> horoscopes = new Dictionary<string, string>()
        {
            {
                "Тоқты",
                "Тоқтылар үшін келе жатқан 2025 жыл өзгерістер мен өсу мүмкіндіктерінің жылы болады. Бұл белгінің өкілдері кез келген жағдайда көшбасшы болуға тырысады, ал жаңа жылда планеталар бұл қасиеттерді күшейте түседі.\r\n\r\n2025 жылдың бірінші жартысы оқуға, саяхаттарға, байланыстарды кеңейтуге және қарым-қатынасқа қолайлы болады. Бұл кәсіби және жеке өмірде маңызды қадамдар мен шешімдер уақыты. Мақсаттарға жету үшін Сатурн сізден көбірек сабыр мен еңбекқорлықты талап етеді. Тамыз айының соңында және қыркүйекте Венера Арыстан белгісінде болып, махаббат секторын белсенді етеді. Бұл жаңа таныстықтар, романтикалық қарым-қатынастарды бастау, үйлену мен отбасын құруға қолайлы кезең."
            },
            {
                "Торпақ",
                "Торпақтар консервативтілігімен белгілі, сондықтан бұл белгі өкілдеріне кез келген өзгерістерді қабылдау қиынға соғады. 2025 жыл олар үшін көптеген толқулар мен күтпеген жағдайлар алып келеді. Бірақ ол сондай-ақ даму мен жаңаруға итермелеуі мүмкін.\r\n\r\nКөктемге дейін Сатурнның әсерінен сіз ұзақ мерзімді мақсаттарыңызға баяу әрі тұрақты түрде ұмтыласыз, ал қол жеткізген жетістіктер өміріңізді тұрақты етеді. Наурыз–сәуірде Венера ретроградтық қозғалыста болған кезде жеке өмірде қиындықтар туындауы мүмкін. Бұл кезеңде басталған жаңа қарым-қатынастар ұзаққа созылмауы ықтимал. Бұдан бөлек, 2025 жылы Уран Торпақ белгісінде қозғалысын жалғастырады, демек, мансап пен кәсіби қызметте маңызды өзгерістер күтіледі. Жазда Уран күтпеген іскерлік ұсыныстар әкелуі мүмкін, олар болашақта табысты арттыруға көмектеседі. Шілдеден қазанға дейін қаржылық жағдайды жақсарту, сондай-ақ оқу, бизнес, саяхаттар мен заңды мәселелерді шешу үшін ең жақсы уақыт болады."
            },
            {
                "Егіздер",
                "2025 жылы Егіздер де өзгерістерге дайын болуы керек, себебі жыл жаңа мүмкіндіктер ашып, ұмытылмас әсерлер сыйлайды. Жыл басында Сатурнның қатаң әсері мақсатқа жету үшін көбірек күш пен табандылықты талап етеді.\r\n\r\nБұл кезең сіздің мансабыңыздағы бетбұрыс болуы мүмкін. Бұрын қойылған мақсаттарды қайта қарауға және кейбір мәселелерде ымыраға келуге тура келеді: бұл сіздің позицияңызды сақтауға мүмкіндік береді. Мамыр айына дейін Юпитер оптимизмді сақтауға және сәттілікті тартуға көмектеседі. Сондықтан басталған істер мен жобалар ұзақ мерзімді перспективада табыс әкеледі және көбірек тұрақтылық уәде етеді. Жазда Егіздер Венера мен Меркурийдің оң әсерін сезінеді, сондықтан бұл кезең қарым-қатынасқа, идеялар алмасуға, жоспарлауға, саудаға, келіссөздерге және жаңа таныстықтарға қолайлы болады. Жалғыз жүргендер үшін екінші жартысын табу мүмкіндігі артады. Маусым айында Юпитер қаржы үйіне ауысады, бұл табыс табудың жаңа мүмкіндіктерін ашады."
            },
            {
                "Шаян",
                "Шаяндарға 2025 жылы мансаптағы өзгерістерге дайындалу керек. Жылдың алғашқы айларында (наурызға дейін) олар үлкен мақсатқа қарай баяу, бірақ сенімді түрде қозғалады. Ал жұмыста жұлдыздар құрмет пен мойындауға уәде береді. Сондай-ақ бұл мүлік сатып алу немесе үй жөндеу үшін жақсы уақыт.\r\n\r\nМаусымнан қазанға дейін Меркурий мен Юпитердің оң әсері жаңа пайдалы байланыстар мен таныстар табуға көмектеседі. Юпитер көп бақыт пен сәттілік әкеледі. Бұл білім алу, бизнес және саяхат, сондай-ақ заң мәселелерін шешуге қолайлы кезең. Бұл уақытта басталған жобалар болашақта табысты болып, жақсы кіріс әкеледі. Денсаулық тұрғысынан бәрі де қолайлы болады. Тамыз айында Венера сіздің белгіге келгенде, жаңа таныстықтар мен романтикалық қарым-қатынастар күтуге болады. Тамыз инвестиция мен ірі сатып алулар үшін сәтті кезең болады."
            },
            {
                "Арыстан",
                "Жылдың бірінші жартысы Арыстандар үшін өте қолайлы болады. Бұл белгінің өкілдері өз ықпалын және беделін нығайтады, сондықтан идеялары мен жобаларын ілгерілету үшін осы мүмкіндікті пайдалану керек. Жаңа романтикалық қарым-қатынастар немесе бар қарым-қатынасты жаңа деңгейге көтеру үшін де бұл кезең қолайлы.\r\n\r\nМамырдан қазанның ортасына дейін Сатурн өміріңіздің көптеген саласына оң әсер етеді: істерде жетістікке жетуге және мансап баспалдағына көтерілуге көмектеседі, мүлікпен жұмыс істеуге, пәтерді, үйді немесе учаскені жақсартуға қолайлы уақыт болады. Шілдеден қарашаға дейін Уран жұмыс орнында өзгерістер жасауға жаңа мүмкіндіктер ашады. Сіз белсенді түрде байланыс жасап, нәтижесінде жаңа достар мен пікірлес адамдар табасыз. Дегенмен, 18 шілдеден 11 тамызға дейін ретроградтық Меркурий кезеңі болады, бұл сапарлар мен жұмыс саласында қиындықтарға немесе жағымсыз жаңалықтарға әкелуі мүмкін."
            },
            {
                "Бикеш",
                "2025 жыл Бикештер үшін жеке және кәсіби өмірде маңызды өзгерістер әкеледі. Көктем мен күз ең маңызды және тағдырлы кезеңдер болады.\r\n\r\nБұл – тұтылу кезеңдері. Наурызда Бикеш белгісінде Ай тұтылып, маңызды кезеңнің аяқталуын көрсетеді. Қыркүйектегі күзгі тұтылу жеке қарым-қатынастар үшін сын кезең болады. Дегенмен жалғыз жүргендер үшін күзде екінші жартысын табу мүмкіндігі артады. Жылдың бірінші жартысында Сатурн қиындықтар мен шектеулер тудыруы мүмкін, бірақ мамыр мен шілде аралығында Уран жағымды өзгерістер әкеледі. Бұл жаңа қызықты адамдармен танысу немесе болашақта табысты болатын ұзақ мерзімді серіктестіктер болуы мүмкін."
            },
            {
                "Таразы",
                "Таразылар үшін 2025 жылдың бірінші жартысы білім алу, шетел тілдерін үйрену және біліктілігін арттыру үшін қолайлы болады. Бұл уақытта басталған жаңа іскерлік серіктестік болашақта жақсы табыс уәде етеді.\r\n\r\nКөктем жақындаған сайын Таразылар өз денсаулығына ерекше назар аударуы керек. Қатты жұмыс пен шамадан тыс жүктемелер иммунитетті төмендетіп, ағзаға кері әсер етуі мүмкін. Сондықтан дәрігерге уақытылы қаралу маңызды. Шілдеден қазанға дейін Юпитер Таразыларды шамадан тыс сенімділік пен күштерін асыра бағалаудан сақтандырады. Бұл уақытта бірден бірнеше жобаны қолға алу ұсынылмайды, әйтпесе күш-қуат бекер жұмсалуы мүмкін. Қыркүйектегі күзгі тұтылу кезінде денсаулыққа ерекше назар аудару керек. Жұмыста да, қарым-қатынастарда да ымыраға келуге дайын болыңыз."
            },
            {
                "Сарышаян",
                "2025 жылдың бірінші жартысында Сарышаяндар болашақ тұрақты өмір үшін мықты негіз қалауға тырысады.\r\n\r\nАқпан айында планеталардың әсері мүлікпен мәмілелер жасауға және үй жөндеуге қолайлы болады. Наурыздағы тұтылу сіз үшін маңызды жобаның аяқталуын білдіреді. Бұл уақытта қаржылық жағдай жақсарады: сіз сыйақы аласыз немесе бұрынғы инвестициялардан жақсы табыс табасыз. Жылдың екінші жартысы (әсіресе шілде мен қыркүйек аралығы) өмірдің көптеген саласы үшін сәтті болады. Юпитердің оң әсері сіздің өзіңізге деген сенімділігіңізді арттырып, материалдық және рухани өсуге ықпал етеді. Бұл жыл оқуға, саяхатқа, бизнеске және заңды мәселелерді шешуге ең жақсы кезеңдердің бірі болады. Қыркүйектегі күзгі тұтылу ішкі тепе-теңдік әкеледі және жеке өмірде маңызды оқиғалармен сүйемелденеді. Бұл уақытта махаббатыңызды табу мүмкіндігі өте жоғары."
            },
            {
                "Мерген",
                "2025 жыл Мергендер үшін жеке қатынастар мен кәсіби өмірге қатысты маңызды оқиғалар мен өзгерістер әкеледі. Бұл жылы жұмыс пен жеке өмір арасындағы тепе-теңдікті сақтау өте маңызды болады, отбасы мен жақын адамдарға көбірек уақыт бөлу қажет.\r\n\r\nНаурыздағы көктемгі тұтылу кезінде сіздің жұмысыңыз бен мансабыңыздағы маңызды кезең аяқталады. Дәл осы уақытта сіздің қызығушылықтарыңыз кеңейіп, жаңа нәрсені үйренуге немесе пайдалы курстарға қатысуға мүмкіндік туады. Наурыз және сәуір айларында жалғызбасты Мергендер үшін жаңа таныстықтар мен романтикалық қарым-қатынастар орнату оңайырақ болады (алайда олардың ұзаққа созылу ықтималдығы төмен). Қыркүйектегі тұтылу кезеңінде үй мен отбасы мәселелері өзекті болады. Близ жақындармен қарым-қатынаста қиындықтар туындауы мүмкін немесе олардың денсаулығына, көшуге байланысты мәселелерді шешуге тура келеді. Бұл кезеңде серіктестеріңіз бен отбасы мүшелеріне көбірек шыдамдылық пен сезімталдық танытуға тырысыңыз."
            },
            {
                "Тауешкі",
                "2025 жылдың ақпан айы Тауешкілер үшін мансап пен бизнес саласында табысты ай болады. Төзімділік, өз-өзіне деген сенімділік және шыдамдылық әсерлі нәтижелерге қол жеткізуге көмектеседі. Лидерлік қабілеттер жаңа маңызды міндеттерді орындауға ықпал етеді.\r\n\r\nКөктемгі тұтылу кезеңінде білім алу, іскерлік мәселелер және алыс сапарлар тақырыптары маңызды болады. Наурыз соңындағы Күннің тұтылуы сынақ кезеңін алып келуі мүмкін. Жалпы, көктемде Тауешкілерді маңызды өзгерістер күтіп тұр: көшу, жұмысты ауыстыру немесе ауқымды жөндеу жұмыстары. Жылдың екінші жартысында серіктестік қарым-қатынастар үлкен мәнге ие болады. Юпитер сізді өмір сапасын жақсартуға, табыс көздерін арттыруға жетелейді. Жалғызбасты Тауешкілер бұл кезеңде өз серігін кездестіруі және тіпті некеге тұруы мүмкін. Күз – білім алуға, жаңа таныстықтарға және пайдалы байланыстар орнатуға қолайлы уақыт."
            },
            {
                "Суқұйғыш",
                "Суқұйғыштарды 2025 жылы үлкен өзгерістер күтіп тұр. Бірақ денсаулық сияқты маңызды құндылықтарды ұмытпау керек: наурыз айындағы көктемгі тұтылу кезінде бұл мәселе ерекше өзекті болады.\r\n\r\nЖылдың бірінші жартысында Юпитердің оң әсері оптимизм мен өз-өзіне деген сенімділік әкеледі. Кірістерді арттыру мүмкіндіктері пайда болады, ал жалғызбасты Суқұйғыштар жаңа таныстар мен романтикалық қарым-қатынастар орнатады. Әсіресе сәуір айы сәтті болады: бұл оқу, саяхат, бизнес жүргізу үшін қолайлы кезең. Жылдың екінші жартысында Юпитер жұмыс пен денсаулық секторына ауысады. Бұл кезеңде жұмыс орнында әріптестермен қарым-қатынас жақсарып, тиімді іскерлік ұсыныстар күтуге болады."
            },
            {
                "Балықтар",
                "2025 жылы Балықтар өздеріне қойған мақсаттарға жетуге мүмкіндік алады. Астрологтың айтуынша, жылдың басында кармалық ай түйіні осы белгіге кіреді. Балықтар үшін ең маңызды кезеңдер көктем мен күз болады: бұл уақытта серіктестік қатынастарға ерекше назар аудару қажет. Жалғызбастылар екінші жартысын табуға мүмкіндік алса, ал қарым-қатынастағылар жаңаруларды немесе сынақтарды басынан өткереді.\r\n\r\nЖылдың екінші жартысында Сатурн мен Нептун белгі ауыстырып, қаржы секторына кіреді. Шілдеден қазанға дейін Юпитердің қолайлы орналасуы табыстардың артуына және қаржылық пайда табуға ықпал етеді. Бұрын жұмыстағы жасаған күш-жігеріңіз жақсы нәтижелер әкеледі: бұл мансаптағы өсу немесе материалдық жағдайды жақсарту болуы мүмкін. Бірақ, егер бұрын сіз жұмыста қажырлылық пен табандылық танытпаған болсаңыз, көңіліңіз қалуы немесе мақсаттарыңызды қайта қарастыру қажеттілігі туындауы мүмкін."
            }
        };

        private Dictionary<int, string> happy_number = new Dictionary<int, string>()
        {
            {1, "1 Cаны. Көшбасшы болып табылады және бірлік қамқорлығындағы адамдар әрқашан және барлық жерде бірінші болады. Олар әсіресе барлық қаржы салаларында және несиелік операцияларда сәттілікке ие болады, бірақ құмар ойындардан бас тартқан жөн.\r\n\r\n1 Саны жаңа істерді, жобалар мен идеяларды қолдайды. Бірлік бар күндерде маңызды өмірлік шешімдер қабылдау және отбасын құру ұсынылады.\r\n\r\nАйдың Cәтті күндері: 1, 10, 19, 28." },
            {2, "2 Саны. Жарнама және жылжымайтын мүлікпен айналысатын адамдарға пайда уәде етеді, сондықтан өмірді осы қызмет салаларымен байланыстырған жөн. Табысқа жету үшін маңызды келіссөздер мен мәмілелерді 2 немесе 22-де жасаған дұрыс.\r\n\r\n Екі адам көбінесе бақытты деп саналады, өйткені сәттілік оларға жиі күледі. Егер сіз нөмірді телефон нөміріне немесе несие картасына қоссаңыз, қаржылық жағдай әрқашан тұрақты болады.\r\n\r\nАйдың сәтті күндері: 2, 11, 20, 29." },
            {3, "3 саны. Сауда саласында жұмыс істейтіндердің барлығына жақсы Сан. Бұл әсіресе өз бизнесі бар адамдарға жақсы әсер етеді-сізге жақсы пайда табуға мүмкіндік береді.\r\n\r\n3 саны әртүрлі даулы мәселелерді шешуге, жанжалдар мен қиындықтардан аулақ болуға көмектеседі, сондықтан оны өз өміріңізге енгізу керек: сіз бөлмеде 3 суретті іліп, 3 мүсіншені қойып, сәттілік пен ақша тарту үшін өзіңізбен бірге 3 тиын немесе 3 бірдей вексель алып жүре аласыз.\r\n\r\nАйдың сәтті күндері: 3, 12, 21, 30." },
            {4, "4 саны. Тұрақтылық пен тәртіптің символы. Төрт махаббат қарым-қатынасына сәттілік әкеледі, дұрыс басымдық беруге және мақсатқа жетуге көмектеседі. Бұл ақша фиаскосынан, жанжалдардан және келіспеушіліктерден аулақ болуға мүмкіндік береді.\r\n\r\nБарлық маңызды мәселелерді бейсенбіде шешіп, әр айдың төртінші күні істерді жоспарлаған дұрыс. Сәттілік саны-4 болатын адамдар өте ұстамды және парасатты, олар сөздерді желге лақтырмайды және өте сақ.\r\n\r\nАйдың сәтті күндері: 4, 13, 22, 31." },
            {5, "5 Саны. Олардың саны-шығармашылық мамандықтағы адамдардың қамқоршысы. Шығармашылық белсенділік бес адамға пайда мен жаңа жеңістер әкеледі, сондықтан олар күнделікті сұр түстен аулақ болу керек.\r\n\r\nЖаңа перспективаларды ашу үшін әрқашан бес тиынды монеталарды алып жүріңіз. Сонымен қатар, 5-махаббат мәні бар сан. Кез-келген айдың 5-і некеге тұру үшін қолайлы.\r\n\r\nАйдың сәтті күндері: 5, 14, 23."},
            {6, "6 Саны. Саяхат және саяхат саны. Оның қамқорлығымен өмір сүретін адамдар үшін іссапарлар мен іссапарлармен байланысты бизнес сәтті болады, бұл олардың мақсаттарына жетуге көмектесетін қозғалыс.\r\n\r\nКүнделікті өмірде алтылықты әрқашан және барлық жерде қолдануға болады, бұл өте бақытты Сан.\r\n\r\nАйдың сәтті күндері: 6, 15, 24." },
            {7, "7 саны. Жеті иесіне өмір бойы сәттілік күледі. Бұл ең керемет идеялар мен керемет жобаларды жүзеге асыруға мүмкіндік беретін ең бақытты және күшті Сан.\r\n\r\nОның қамқорлығындағы адамдар әлемдік даңққа қол жеткізе алады және тарихта өз іздерін қалдыра алады. Күнделікті өмірде 7 саны барлық мәселелерде сәттілік әкеледі, кез-келген жағдайдан шығудың жолын табуға көмектеседі, әрдайым және кез-келген жағдайда тек алға жылжуға мүмкіндік береді.\r\n\r\nАйдың сәтті күндері: 7, 16, 25." },
            {8, "8 саны. Сегіздік адамдар көбінесе армандаушылар болып табылады, бірақ сонымен бірге олар өмірде айтарлықтай жетістіктерге жетеді, табысты кәсіпкерлер мен менеджерлерге айналады.\r\n\r\nБарлық маңызды іс-шараларды айдың 8-ші күніне немесе тамызға жоспарлаңыз. Бұл уақытта сіз шексіз сәттілікке ие боласыз, өйткені 8-шексіздіктің саны, бірақ әйелдер күндердегі тұжырымдама жүктілікті қиындатуы мүмкін екенін ескеруі керек.\r\n\r\nАйдың сәтті күндері: 8, 17, 26." },
            {9, "9 саны. Тоғыздың иелері мүмкіндігінше пайдалы танысу керек, өйткені олар әдетте басқалардың еңбегімен жетістікке жетеді. Бұл көрсеткіш жаңа білім алуға ықпал етеді-ол қамқоршыларға, мысалы, шет тілдерін үйрену оңай.\r\n\r\nТоғыз қорытындылауға көмектеседі, сондықтан бұл сан бар күндерде ағымдағы істерді аяқтау, кірістер мен шығыстарды есептеу ұсынылады. Осы күндері барлық жаңа бастамалар сәтсіздікке ұшырайды және сіздің пайдаңызға аяқталмауы мүмкін.\r\n\r\nАйдың сәтті күндері: 9, 18, 27." }
        };


        private void button1_Click(object sender, EventArgs e)
        {
            DateTime birthDate = dateTimePicker2.Value;
            string zodiac = GetZodiac(birthDate);
            ResultName.Text = zodiac+"!";
            ResultDescription.Text = horoscopes[zodiac];
            RoundControl(ResultDescription, 30);
            RoundControl(ResultName, 30);
            ResultDescription.Left = (this.ClientSize.Width - ResultDescription.Width) / 2;
            ResultName.Left = (this.ClientSize.Width - ResultName.Width) / 2;

            dateTimePicker2.Visible = false;
            button1.Visible = false;
            label2.Visible = false;
            label1.Visible = false;
            happy.Visible = false;
            back.Visible = true;
            save.Visible = true;

            pictureZodiac.Image = Image.FromFile($"C:\\Users\\nurga\\source\\repos\\Horoscope\\Horoscope\\images\\{zodiac}.gif");
            pictureZodiac.Left = (this.ClientSize.Width - pictureZodiac.Width) / 2;
            pictureZodiac.Top = ResultDescription.Bottom+10;
            double d = (double)pictureZodiac.Width * 1.4;
            pictureZodiac.Width = (int)d;
            double h = (double)pictureZodiac.Height * 1.4;
            pictureZodiac.Height = (int)h;
            pictureZodiac.Left = (this.ClientSize.Width - pictureZodiac.Width) / 2;
            pictureZodiac.Visible = true;
        }

        private void back_Click(object sender, EventArgs e)
        {
            ResultName.Text = "";
            ResultDescription.Text = "";

            pictureZodiac.Visible = false;
            pictureZodiac.Width = 227;
            pictureZodiac.Height = 224;

            dateTimePicker2.Visible = true;
            button1.Visible = true;
            label2.Visible = true;
            label1.Visible = true;
            happy.Visible = true;
            back.Visible = false;
            save.Visible = false;
        }

        private void label1_Click(object sender, EventArgs e)
        {
            // керек емес
        }

        private void SaveAsTxt(string text)
        {
            SaveFileDialog sfd = new SaveFileDialog();
            sfd.Filter = "Text file (*.txt)|*.txt";
            sfd.FileName = "prediction.txt";

            if (sfd.ShowDialog() == DialogResult.OK)
            {
                File.WriteAllText(sfd.FileName, text, Encoding.UTF8);
                MessageBox.Show("Файл сәтті сақталды!");
            }
        }

        private void save_Click(object sender, EventArgs e)
        {
            SaveAsTxt(ResultName.Text + "\r\n\r\n" + ResultDescription.Text);
        }

        private int GetLuckyNumber(DateTime date)
        {
            int sum = 0;
            foreach (char c in date.ToString("ddMMyyyy"))
            {
                sum += c - '0';
            }

            while (sum > 9)
            {
                int temp = 0;
                while (sum > 0)
                {
                    temp += sum % 10;
                    sum /= 10;
                }
                sum = temp;
            }

            return sum;
        }

        private void happy_Click(object sender, EventArgs e)
        {
            int num = GetLuckyNumber(dateTimePicker2.Value);

            ResultName.Text = "Сіздің бақытты саныңыз: " + num + "!";
            ResultDescription.Text = happy_number[num];
            RoundControl(ResultDescription, 30);
            RoundControl(ResultName, 30);
            ResultDescription.Left = (this.ClientSize.Width - ResultDescription.Width) / 2;
            ResultName.Left = (this.ClientSize.Width - ResultName.Width) / 2;

            dateTimePicker2.Visible = false;
            button1.Visible = false;
            happy.Visible = false;
            label2.Visible = false;
            label1.Visible = false;
            back.Visible = true;
            save.Visible = true;
        }
    }
}
